Revit 2025 API
WaterLoopType Enumeration
 The type of water loop.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum WaterLoopType
Public Enumeration WaterLoopType
public enum class WaterLoopType
type WaterLoopType
Members
Member name | Value | Description
Undefined | 0
ChilledWater | 1
CondenserWater | 2
HotWater | 3
VRF | 4
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace